# #Fire up GraphLab Create

In [23]:
#import graphlab
from pandas import Series, DataFrame
import pandas as pd

ImportError: No module named graphlab

In [12]:
## Here pandas is working
df = pd.read_csv('people-example.csv')

In [14]:
people_data = DataFrame(df)
people_data

  First Name Last Name        Country  age
0        Bob     Smith  United States   24
1      Alice  Williams         Canada   23
2    Malcolm      Jone        England   22
3      Felix     Brown            USA   23
4       Alex    Cooper         Poland   23
5        Tod  Campbell  United States   22
6      Derek      Ward    Switzerland   25

In [18]:
myFeatures = ['First Name', 'Last Name', 'age']

In [22]:
df[myFeatures]

  First Name Last Name  age
0        Bob     Smith   24
1      Alice  Williams   23
2    Malcolm      Jone   22
3      Felix     Brown   23
4       Alex    Cooper   23
5        Tod  Campbell   22
6      Derek      Ward   25